            org     0

            di
            ld      a, 0*8 + 7
            call    cls         ; Очистить экран
            call    kb_init     ; Инициализация клавиатуры
            ld      hl, greets
            call    prn_str     ; Пропечатать приветственную строку
            call    prn_show    ; Показать курсор
kbloop:     call    kb_ascii    ; Ожидать ввода символа
            call    prn_print   ; Пропечатка символа
            jr      kbloop

; ----------------------------------------------------------------------
greets:     defb    127," 2021 What is fox say?",10,"Ok",10,0
; ----------------------------------------------------------------------
include     "../lib/print.asm"
include     "../lib/keyb.asm"
; ----------------------------------------------------------------------

